In [1]:
import pandas as pd

In [2]:
data = {
    "name" : ["홍길동","임꺽정","성춘향"],
    "age" : [25,None,20],
    "city" : ["서울","부산",None]}

df = pd.DataFrame(data)
df

  name   age  city
0  홍길동  25.0    서울
1  임꺽정   NaN    부산
2  성춘향  20.0  None

In [3]:
df.isnull()

    name    age   city
0  False  False  False
1  False   True  False
2  False  False   True

In [4]:
df.isnull().sum()

name    0
age     1
city    1
dtype: int64

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     2 non-null      float64
 2   city    2 non-null      object
dtypes: float64(1), object(2)
memory usage: 204.0+ bytes

In [6]:
df_drop = df.dropna()
df_drop

  name   age city
0  홍길동  25.0   서울

In [7]:
df_drop_column = df.dropna(axis=1)
df_drop_column

  name
0  홍길동
1  임꺽정
2  성춘향

In [8]:
df_fill = df.fillna(0)
df_fill

  name   age city
0  홍길동  25.0   서울
1  임꺽정   0.0   부산
2  성춘향  20.0    0

In [9]:
df_fill_f = df.ffill()
df_fill_f

  name   age city
0  홍길동  25.0   서울
1  임꺽정  25.0   부산
2  성춘향  20.0   부산

In [10]:
df_fill_b = df.bfill()
df_fill_b

  name   age  city
0  홍길동  25.0    서울
1  임꺽정  20.0    부산
2  성춘향  20.0  None

In [11]:
s =  pd.Series(["홍길동","임꺽정","성춘향","이몽룡"])
result = s.isin(["홍길동","이몽룡"])
result

0     True
1    False
2    False
3     True
dtype: bool

In [12]:
data = {"name" : ["홍길동","임꺽정","성춘향","이몽룡"],
    "age" : [25,30,20,32]}

df = pd.DataFrame(data)
result = df.isin(["성춘향","홍길동",20])
result

    name    age
0   True  False
1  False  False
2   True   True
3  False  False

In [13]:
s = pd.Series([1,2,None])
result = s.isin([None,2]) #None은 isin 메서드에서 무시됌
result

0    False
1     True
2    False
dtype: bool

In [14]:
result = df[df['name'].isin(['성춘향','홍길동'])]
result

  name  age
0  홍길동   25
2  성춘향   20

In [15]:
s = pd.Series(['사과','바나나','사과','오렌지','바나나','사과'])
s.value_counts()

사과     3
바나나    2
오렌지    1
Name: count, dtype: int64

In [16]:
df = pd.DataFrame({
    "과일" : ['사과','바나나','사과','오렌지','바나나','사과'],
    "수량" : [1,2,3,4,5,6]
})
df['과일'].value_counts(normalize=True) #빈도를 %로 계산

과일
사과     0.500000
바나나    0.333333
오렌지    0.166667
Name: proportion, dtype: float64

In [17]:
df['과일'].value_counts(ascending=True) #오름차순으로 정렬

과일
오렌지    1
바나나    2
사과     3
Name: count, dtype: int64

In [18]:
df = pd.DataFrame({
    "과일" : ['사과',None,'사과','오렌지','바나나','사과'],
    "수량" : [1,2,3,4,5,6]
})
df['과일'].value_counts(dropna=False) #결측값도 포함하여 결과 출력

과일
사과      3
None    1
오렌지     1
바나나     1
Name: count, dtype: int64

In [19]:
s = pd.Series([1,2,3,4,5])
result = s.agg(['sum','mean','max'])
result

sum     15.0
mean     3.0
max      5.0
dtype: float64

In [20]:
df = pd.DataFrame({
    'a' : [1,2,3],
    'b' : [10,11,12]
})

df.agg(['sum','mean','max'])

        a     b
sum   6.0  33.0
mean  2.0  11.0
max   3.0  12.0

In [21]:
df.agg({'a':'sum','b':'mean'})

a     6.0
b    11.0
dtype: float64

In [22]:
s1 = pd.Series([10,20,30])
s2 = pd.Series([5,15,25])
s1+s2

0    15
1    35
2    55
dtype: int64

In [23]:
s1-s2

0    5
1    5
2    5
dtype: int64

In [24]:
s1*s2

0     50
1    300
2    750
dtype: int64

In [25]:
s1/s2

0    2.000000
1    1.333333
2    1.200000
dtype: float64

In [26]:
s1>15

0    False
1     True
2     True
dtype: bool

In [27]:
s1.sum()

np.int64(60)

In [28]:
s1.mean()

np.float64(20.0)

In [29]:
s1.max()

np.int64(30)

In [30]:
s1.std()

np.float64(10.0)

In [31]:
s1.var()

np.float64(100.0)

In [32]:
s1.median()

np.float64(20.0)

In [33]:
s1.describe()

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

In [34]:
data = {
    'group' : ['A','A','B','B','C'],
    'value' : [10,20,30,40,50]
}

df = pd.DataFrame(data)
df
result = df.groupby('group')['value'].sum()
result

group
A    30
B    70
C    50
Name: value, dtype: int64

In [35]:
result = df.groupby('group')['value'].agg(['sum','mean','max'])
result

       sum  mean  max
group
A       30  15.0   20
B       70  35.0   40
C       50  50.0   50

In [36]:
data = {
    'group' : ['A','A','B','B','C'],
    'value' : [10,20,30,40,50],
    'value2' : [5,15,25,35,45]
}

df = pd.DataFrame(data)
result = df.groupby('group').agg({
    'value' : 'sum',
    'value2' : 'mean'
})
result

       value  value2
group
A         30    10.0
B         70    30.0
C         50    45.0

In [37]:
df = pd.DataFrame(data)
result = df.groupby('group').agg({
    'value' : 'sum',
    'value2' : ['mean','max']
})
result

      value value2
        sum   mean max
group
A        30   10.0  15
B        70   30.0  35
C        50   45.0  45

In [38]:
result = df.groupby('group').filter(lambda x:x['value'].sum() > 30)
result

  group  value  value2
2     B     30      25
3     B     40      35
4     C     50      45